/*
===============================================================================
Проверка качества
===============================================================================
Назначение скрипта:
    Этот скрипт выполняет проверку качества для проверки целостности, согласованности
и точности золотого слоя. Эти проверки обеспечивают:
    - Уникальность суррогатных ключей в таблицах измерений.
    - Ссылочную целостность между таблицами фактов и таблицами измерений.
    - Проверку взаимосвязей в модели данных для аналитических целей.

Указания по использованию:
    - Изучите и устраните любые несоответствия, обнаруженные в ходе проверок.
===============================================================================
*/

-- ====================================================================
-- Проверка 'gold.dim_customers'
-- ====================================================================
-- Проверьте уникальность ключа клиента в gold.dim_customers
-- Ожидание: Никаких результатов
SELECT 
    customer_key,
    COUNT(*) AS duplicate_count
FROM gold.dim_customers
GROUP BY customer_key
HAVING COUNT(*) > 1;

-- ====================================================================
-- Проверяем 'gold.product_key'
-- ====================================================================
-- Проверьте уникальность ключа продукта в gold.dim_products
-- Ожидание: Никаких результатов 
SELECT 
    product_key,
    COUNT(*) AS duplicate_count
FROM gold.dim_products
GROUP BY product_key
HAVING COUNT(*) > 1;

-- ====================================================================
-- Проверка "gold.fact_sales"
-- ====================================================================
-- Проверьте связь модели данных между фактом и измерениями
SELECT * 
FROM gold.fact_sales f
LEFT JOIN gold.dim_customers c
ON c.customer_key = f.customer_key
LEFT JOIN gold.dim_products p
ON p.product_key = f.product_key
WHERE p.product_key IS NULL OR c.customer_key IS NULL  
