/*
===============================================================================
Проверка качества
===============================================================================
Назначение скрипта:
    Этот скрипт выполняет различные проверки качества на согласованность, точность
и стандартизацию данных на уровне "silver". Он включает в себя проверку на наличие:
    - Нулевых или повторяющихся первичных ключей.
    - Ненужных пробелов в строковых полях.
    - Стандартизацию и согласованность данных.
    - Недопустимые диапазоны дат и порядок следования дат.
    - Согласованность данных между связанными полями.

Рекомендации по использованию:
    - Запустите эти проверки после загрузки данных в Silver Layer.
    - Изучите и устраните любые несоответствия, обнаруженные в ходе проверок.
===============================================================================
*/

-- ====================================================================
-- Проверяем  'silver.crm_cust_info'
-- ====================================================================
-- Проверьте, нет ли нулей или дубликатов в первичном ключе
-- Ожидание: Никаких результатов
SELECT 
    cst_id,
    COUNT(*) 
FROM silver.crm_cust_info
GROUP BY cst_id
HAVING COUNT(*) > 1 OR cst_id IS NULL;

-- Проверьте, нет ли ненужных пробелов
-- Ожидание: Никаких результатов
SELECT 
    cst_key 
FROM silver.crm_cust_info
WHERE cst_key != TRIM(cst_key);

-- Стандартизация и согласованность данных
SELECT DISTINCT 
    cst_marital_status 
FROM silver.crm_cust_info;

-- ====================================================================
-- Проверяем  'silver.crm_prd_info'
-- ====================================================================
-- Проверьте, нет ли нулей или дубликатов в первичном ключе
-- Ожидание: Никаких результатов
SELECT 
    prd_id,
    COUNT(*) 
FROM silver.crm_prd_info
GROUP BY prd_id
HAVING COUNT(*) > 1 OR prd_id IS NULL;

-- Проверьте, нет ли ненужных пробелов
-- Ожидание: Никаких результатов
SELECT 
    prd_nm 
FROM silver.crm_prd_info
WHERE prd_nm != TRIM(prd_nm);

-- Проверьте, нет ли нулевых или отрицательных значений в стоимости
-- Ожидание: Никаких результатов
SELECT 
    prd_cost 
FROM silver.crm_prd_info
WHERE prd_cost < 0 OR prd_cost IS NULL;

-- Стандартизация и согласованность данных
SELECT DISTINCT 
    prd_line 
FROM silver.crm_prd_info;

-- Проверьте, нет ли недействительных дат заказа (Начальная дата > Конечная дата)
-- Ожидание: Никаких результатов
SELECT 
    * 
FROM silver.crm_prd_info
WHERE prd_end_dt < prd_start_dt;

-- ====================================================================
-- Проверяем  'silver.crm_sales_details'
-- ====================================================================
-- Проверьте, нет ли неверных дат
-- Ожидание: Никаких недопустимых дат
SELECT 
    NULLIF(sls_due_dt, 0) AS sls_due_dt 
FROM bronze.crm_sales_details
WHERE sls_due_dt <= 0 
    OR LEN(sls_due_dt) != 8 
    OR sls_due_dt > 20500101 
    OR sls_due_dt < 19000101;

-- Проверьте, нет ли в заказах недействительных дат (Дата заказа > Сроки доставки/оплаты).
-- Ожидание: Никаких результатов
SELECT 
    * 
FROM silver.crm_sales_details
WHERE sls_order_dt > sls_ship_dt 
   OR sls_order_dt > sls_due_dt;

-- Проверка согласованности данных: Sales = Quantity * Price
-- Ожидание: Никаких результатов
SELECT DISTINCT 
    sls_sales,
    sls_quantity,
    sls_price 
FROM silver.crm_sales_details
WHERE sls_sales != sls_quantity * sls_price
   OR sls_sales IS NULL 
   OR sls_quantity IS NULL 
   OR sls_price IS NULL
   OR sls_sales <= 0 
   OR sls_quantity <= 0 
   OR sls_price <= 0
ORDER BY sls_sales, sls_quantity, sls_price;

-- ====================================================================
-- Проверяем  'silver.erp_cust_az12'
-- ====================================================================
-- Определение дат, выходящих за рамки допустимого диапазона
-- Ожидаемые даты: Даты рождения между 1924-01-01 и сегодняшним днем
SELECT DISTINCT 
    bdate 
FROM silver.erp_cust_az12
WHERE bdate < '1924-01-01' 
   OR bdate > GETDATE();

-- Стандартизация и согласованность данных
SELECT DISTINCT 
    gen 
FROM silver.erp_cust_az12;

-- ====================================================================
-- Проверяем  'silver.erp_loc_a101'
-- ====================================================================
-- Стандартизация и согласованность данных
SELECT DISTINCT 
    cntry 
FROM silver.erp_loc_a101
ORDER BY cntry;

-- ====================================================================
-- Проверяем  'silver.erp_px_cat_g1v2'
-- ====================================================================
-- Проверьте, нет ли ненужных пробелов
-- Ожидание: Никаких результатов
SELECT 
    * 
FROM silver.erp_px_cat_g1v2
WHERE cat != TRIM(cat) 
   OR subcat != TRIM(subcat) 
   OR maintenance != TRIM(maintenance);

-- Стандартизация и согласованность данных
SELECT DISTINCT 
    maintenance 
FROM silver.erp_px_cat_g1v2;
